const countries = [
  {
    "code": "+81",
    "name": "日本"
  },
  {
    "code": "+886",
    "name": "台湾"
  },
  {
    "code": "+86",
    "name": "中国"
  },
  {
    "code": "+852",
    "name": "香港"
  },
  {
    "code": "+853",
    "name": "マカオ"
  },
  {
    "code": "+93",
    "name": "アフガニスタン"
  },
  {
    "code": "+355",
    "name": "アルバニア"
  },
  {
    "code": "+213",
    "name": "アルジェリア"
  },
  {
    "code": "+1-684",
    "name": "アメリカ領サモア"
  },
  {
    "code": "+376",
    "name": "アンドラ"
  },
  {
    "code": "+244",
    "name": "アンゴラ"
  },
  {
    "code": "+1-264",
    "name": "アンギラ"
  },
  {
    "code": "",
    "name": "南極大陸"
  },
  {
    "code": "+1-268",
    "name": "アンティグア・バーブーダ"
  },
  {
    "code": "+54",
    "name": "アルゼンチン"
  },
  {
    "code": "+374",
    "name": "アルメニア"
  },
  {
    "code": "+297",
    "name": "アルバ"
  },
  {
    "code": "+61",
    "name": "オーストラリア"
  },
  {
    "code": "+43",
    "name": "オーストリア"
  },
  {
    "code": "+994",
    "name": "アゼルバイジャン"
  },
  {
    "code": "+1-242",
    "name": "バハマ"
  },
  {
    "code": "+973",
    "name": "バーレーン"
  },
  {
    "code": "+880",
    "name": "バングラデシュ"
  },
  {
    "code": "+1-246",
    "name": "バルバドス"
  },
  {
    "code": "+375",
    "name": "ベラルーシ"
  },
  {
    "code": "+32",
    "name": "ベルギー"
  },
  {
    "code": "+501",
    "name": "ベリーズ"
  },
  {
    "code": "+229",
    "name": "ベナン"
  },
  {
    "code": "+1-441",
    "name": "バミューダ"
  },
  {
    "code": "+975",
    "name": "ブータン"
  },
  {
    "code": "+591",
    "name": "ボリビア"
  },
  {
    "code": "+599",
    "name": "ボネール、シント・ユースタティウス、サバ"
  },
  {
    "code": "+387",
    "name": "ボスニア・ヘルツェゴビナ"
  },
  {
    "code": "+267",
    "name": "ボツワナ"
  },
  {
    "code": "",
    "name": "ブーベ島"
  },
  {
    "code": "+55",
    "name": "ブラジル"
  },
  {
    "code": "+246",
    "name": "英領インド洋地域"
  },
  {
    "code": "+673",
    "name": "ブルネイ・ダルサラーム"
  },
  {
    "code": "+359",
    "name": "ブルガリア"
  },
  {
    "code": "+226",
    "name": "ブルキナファソ"
  },
  {
    "code": "+257",
    "name": "ブルンジ"
  },
  {
    "code": "+238",
    "name": "カーボベルデ"
  },
  {
    "code": "+855",
    "name": "カンボジア"
  },
  {
    "code": "+237",
    "name": "カメルーン"
  },
  {
    "code": "+1",
    "name": "アメリカ合衆国 / カナダ"
  },
  {
    "code": "+1-345",
    "name": "ケイマン諸島"
  },
  {
    "code": "+236",
    "name": "中央アフリカ共和国"
  },
  {
    "code": "+235",
    "name": "チャド"
  },
  {
    "code": "+56",
    "name": "チリ"
  },
  {
    "code": "+61",
    "name": "クリスマス島"
  },
  {
    "code": "+61",
    "name": "ココス諸島"
  },
  {
    "code": "+57",
    "name": "コロンビア"
  },
  {
    "code": "+269",
    "name": "コモロ"
  },
  {
    "code": "+243",
    "name": "コンゴ民主共和国"
  },
  {
    "code": "+242",
    "name": "コンゴ共和国"
  },
  {
    "code": "+682",
    "name": "クック諸島"
  },
  {
    "code": "+506",
    "name": "コスタリカ"
  },
  {
    "code": "+385",
    "name": "クロアチア"
  },
  {
    "code": "+53",
    "name": "キューバ"
  },
  {
    "code": "+599",
    "name": "キュラソー"
  },
  {
    "code": "+357",
    "name": "キプロス"
  },
  {
    "code": "+420",
    "name": "チェコ"
  },
  {
    "code": "+225",
    "name": "コートジボワール"
  },
  {
    "code": "+45",
    "name": "デンマーク"
  },
  {
    "code": "+253",
    "name": "ジブチ"
  },
  {
    "code": "+1-767",
    "name": "ドミニカ"
  },
  {
    "code": "+1-809",
    "name": "ドミニカ共和国"
  },
  {
    "code": "+593",
    "name": "エクアドル"
  },
  {
    "code": "+20",
    "name": "エジプト"
  },
  {
    "code": "+503",
    "name": "エルサルバドル"
  },
  {
    "code": "+240",
    "name": "赤道ギニア"
  },
  {
    "code": "+291",
    "name": "エリトリア"
  },
  {
    "code": "+372",
    "name": "エストニア"
  },
  {
    "code": "+268",
    "name": "エスワティニ"
  },
  {
    "code": "+251",
    "name": "エチオピア"
  },
  {
    "code": "+500",
    "name": "フォークランド諸島"
  },
  {
    "code": "+298",
    "name": "フェロー諸島"
  },
  {
    "code": "+679",
    "name": "フィジー"
  },
  {
    "code": "+358",
    "name": "フィンランド"
  },
  {
    "code": "+33",
    "name": "フランス"
  },
  {
    "code": "+594",
    "name": "仏領ギアナ"
  },
  {
    "code": "+689",
    "name": "仏領ポリネシア"
  },
  {
    "code": "",
    "name": "フランス領南方・南極地域"
  },
  {
    "code": "+241",
    "name": "ガボン"
  },
  {
    "code": "+220",
    "name": "ガンビア"
  },
  {
    "code": "+995",
    "name": "ジョージア"
  },
  {
    "code": "+49",
    "name": "ドイツ"
  },
  {
    "code": "+233",
    "name": "ガーナ"
  },
  {
    "code": "+350",
    "name": "ジブラルタル"
  },
  {
    "code": "+30",
    "name": "ギリシャ"
  },
  {
    "code": "+299",
    "name": "グリーンランド"
  },
  {
    "code": "+1-473",
    "name": "グレナダ"
  },
  {
    "code": "+590",
    "name": "グアドループ"
  },
  {
    "code": "+1-671",
    "name": "グアム"
  },
  {
    "code": "+502",
    "name": "グアテマラ"
  },
  {
    "code": "",
    "name": "ガーンジー"
  },
  {
    "code": "+224",
    "name": "ギニア"
  },
  {
    "code": "+245",
    "name": "ギニアビサウ"
  },
  {
    "code": "+592",
    "name": "ガイアナ"
  },
  {
    "code": "+509",
    "name": "ハイチ"
  },
  {
    "code": "",
    "name": "ハード島とマクドナルド諸島"
  },
  {
    "code": "",
    "name": "バチカン市国"
  },
  {
    "code": "+504",
    "name": "ホンジュラス"
  },
  {
    "code": "+36",
    "name": "ハンガリー"
  },
  {
    "code": "+354",
    "name": "アイスランド"
  },
  {
    "code": "+91",
    "name": "インド"
  },
  {
    "code": "+62",
    "name": "インドネシア"
  },
  {
    "code": "+98",
    "name": "イラン"
  },
  {
    "code": "+964",
    "name": "イラク"
  },
  {
    "code": "+353",
    "name": "アイルランド"
  },
  {
    "code": "",
    "name": "マン島"
  },
  {
    "code": "+972",
    "name": "イスラエル"
  },
  {
    "code": "+39",
    "name": "イタリア"
  },
  {
    "code": "+1-876",
    "name": "ジャマイカ"
  },
  {
    "code": "",
    "name": "ジャージー"
  },
  {
    "code": "+962",
    "name": "ヨルダン"
  },
  {
    "code": "+7",
    "name": "カザフスタン"
  },
  {
    "code": "+254",
    "name": "ケニア"
  },
  {
    "code": "+686",
    "name": "キリバス"
  },
  {
    "code": "+850",
    "name": "北朝鮮"
  },
  {
    "code": "+82",
    "name": "韓国"
  },
  {
    "code": "+965",
    "name": "クウェート"
  },
  {
    "code": "+996",
    "name": "キルギス"
  },
  {
    "code": "+856",
    "name": "ラオス"
  },
  {
    "code": "+371",
    "name": "ラトビア"
  },
  {
    "code": "+961",
    "name": "レバノン"
  },
  {
    "code": "+266",
    "name": "レソト"
  },
  {
    "code": "+231",
    "name": "リベリア"
  },
  {
    "code": "+218",
    "name": "リビア"
  },
  {
    "code": "+423",
    "name": "リヒテンシュタイン"
  },
  {
    "code": "+370",
    "name": "リトアニア"
  },
  {
    "code": "+352",
    "name": "ルクセンブルク"
  },
  {
    "code": "+261",
    "name": "マダガスカル"
  },
  {
    "code": "+265",
    "name": "マラウイ"
  },
  {
    "code": "+60",
    "name": "マレーシア"
  },
  {
    "code": "+960",
    "name": "モルディブ"
  },
  {
    "code": "+223",
    "name": "マリ"
  },
  {
    "code": "+356",
    "name": "マルタ"
  },
  {
    "code": "+692",
    "name": "マーシャル諸島"
  },
  {
    "code": "+596",
    "name": "マルティニーク"
  },
  {
    "code": "+222",
    "name": "モーリタニア"
  },
  {
    "code": "+230",
    "name": "モーリシャス"
  },
  {
    "code": "+262",
    "name": "マヨット"
  },
  {
    "code": "+52",
    "name": "メキシコ"
  },
  {
    "code": "+691",
    "name": "ミクロネシア"
  },
  {
    "code": "+373",
    "name": "モルドバ"
  },
  {
    "code": "+377",
    "name": "モナコ"
  },
  {
    "code": "+976",
    "name": "モンゴル"
  },
  {
    "code": "+382",
    "name": "モンテネグロ"
  },
  {
    "code": "+1-664",
    "name": "モントセラト"
  },
  {
    "code": "+212",
    "name": "モロッコ"
  },
  {
    "code": "+258",
    "name": "モザンビーク"
  },
  {
    "code": "+95",
    "name": "ミャンマー"
  },
  {
    "code": "+264",
    "name": "ナミビア"
  },
  {
    "code": "+674",
    "name": "ナウル"
  },
  {
    "code": "+977",
    "name": "ネパール"
  },
  {
    "code": "+31",
    "name": "オランダ"
  },
  {
    "code": "+687",
    "name": "ニューカレドニア"
  },
  {
    "code": "+64",
    "name": "ニュージーランド"
  },
  {
    "code": "+505",
    "name": "ニカラグア"
  },
  {
    "code": "+227",
    "name": "ニジェール"
  },
  {
    "code": "+234",
    "name": "ナイジェリア"
  },
  {
    "code": "+683",
    "name": "ニウエ"
  },
  {
    "code": "+672",
    "name": "ノーフォーク島"
  },
  {
    "code": "+1-670",
    "name": "北マリアナ諸島"
  },
  {
    "code": "+47",
    "name": "ノルウェー"
  },
  {
    "code": "+968",
    "name": "オマーン"
  },
  {
    "code": "+92",
    "name": "パキスタン"
  },
  {
    "code": "+680",
    "name": "パラオ"
  },
  {
    "code": "+970",
    "name": "パレスチナ"
  },
  {
    "code": "+507",
    "name": "パナマ"
  },
  {
    "code": "+675",
    "name": "パプアニューギニア"
  },
  {
    "code": "+595",
    "name": "パラグアイ"
  },
  {
    "code": "+51",
    "name": "ペルー"
  },
  {
    "code": "+63",
    "name": "フィリピン"
  },
  {
    "code": "+64",
    "name": "ピトケアン"
  },
  {
    "code": "+48",
    "name": "ポーランド"
  },
  {
    "code": "+351",
    "name": "ポルトガル"
  },
  {
    "code": "+1-787",
    "name": "プエルトリコ"
  },
  {
    "code": "+974",
    "name": "カタール"
  },
  {
    "code": "+389",
    "name": "北マケドニア"
  },
  {
    "code": "+40",
    "name": "ルーマニア"
  },
  {
    "code": "+7",
    "name": "ロシア"
  },
  {
    "code": "+250",
    "name": "ルワンダ"
  },
  {
    "code": "+262",
    "name": "レユニオン"
  },
  {
    "code": "+590",
    "name": "サン・バルテルミー"
  },
  {
    "code": "+290",
    "name": "セントヘレナ、アセンション島、トリスタンダクーナ"
  },
  {
    "code": "+1-869",
    "name": "セントクリストファー・ネイビス"
  },
  {
    "code": "+1-758",
    "name": "セントルシア"
  },
  {
    "code": "+590",
    "name": "サン・マルタン"
  },
  {
    "code": "+508",
    "name": "サンピエール島・ミクロン島"
  },
  {
    "code": "+1-784",
    "name": "セントビンセントおよびグレナディーン諸島"
  },
  {
    "code": "+685",
    "name": "サモア"
  },
  {
    "code": "+378",
    "name": "サンマリノ"
  },
  {
    "code": "+239",
    "name": "サントメ・プリンシペ"
  },
  {
    "code": "+966",
    "name": "サウジアラビア"
  },
  {
    "code": "+221",
    "name": "セネガル"
  },
  {
    "code": "+381",
    "name": "セルビア"
  },
  {
    "code": "+248",
    "name": "セーシェル"
  },
  {
    "code": "+232",
    "name": "シエラレオネ"
  },
  {
    "code": "+65",
    "name": "シンガポール"
  },
  {
    "code": "+1-721",
    "name": "シント・マールテン"
  },
  {
    "code": "+421",
    "name": "スロバキア"
  },
  {
    "code": "+386",
    "name": "スロベニア"
  },
  {
    "code": "+677",
    "name": "ソロモン諸島"
  },
  {
    "code": "+252",
    "name": "ソマリア"
  },
  {
    "code": "+27",
    "name": "南アフリカ"
  },
  {
    "code": "",
    "name": "サウスジョージア・サウスサンドウィッチ諸島"
  },
  {
    "code": "+211",
    "name": "南スーダン"
  },
  {
    "code": "+34",
    "name": "スペイン"
  },
  {
    "code": "+94",
    "name": "スリランカ"
  },
  {
    "code": "+249",
    "name": "スーダン"
  },
  {
    "code": "+597",
    "name": "スリナム"
  },
  {
    "code": "+47",
    "name": "スヴァールバル諸島・ヤンマイエン島"
  },
  {
    "code": "+46",
    "name": "スウェーデン"
  },
  {
    "code": "+41",
    "name": "スイス"
  },
  {
    "code": "+963",
    "name": "シリア"
  },
  {
    "code": "+992",
    "name": "タジキスタン"
  },
  {
    "code": "+255",
    "name": "タンザニア"
  },
  {
    "code": "+66",
    "name": "タイ"
  },
  {
    "code": "+670",
    "name": "東ティモール"
  },
  {
    "code": "+228",
    "name": "トーゴ"
  },
  {
    "code": "+690",
    "name": "トケラウ"
  },
  {
    "code": "+676",
    "name": "トンガ"
  },
  {
    "code": "+1-868",
    "name": "トリニダード・トバゴ"
  },
  {
    "code": "+216",
    "name": "チュニジア"
  },
  {
    "code": "+90",
    "name": "トルコ"
  },
  {
    "code": "+993",
    "name": "トルクメニスタン"
  },
  {
    "code": "+1-649",
    "name": "タークス・カイコス諸島"
  },
  {
    "code": "+688",
    "name": "ツバル"
  },
  {
    "code": "+256",
    "name": "ウガンダ"
  },
  {
    "code": "+380",
    "name": "ウクライナ"
  },
  {
    "code": "+971",
    "name": "アラブ首長国連邦"
  },
  {
    "code": "+44",
    "name": "イギリス"
  },
  {
    "code": "",
    "name": "米領太平洋諸島"
  },
  {
    "code": "+598",
    "name": "ウルグアイ"
  },
  {
    "code": "+998",
    "name": "ウズベキスタン"
  },
  {
    "code": "+678",
    "name": "バヌアツ"
  },
  {
    "code": "+58",
    "name": "ベネズエラ"
  },
  {
    "code": "+84",
    "name": "ベトナム"
  },
  {
    "code": "+1-284",
    "name": "英領バージン諸島"
  },
  {
    "code": "+1-340",
    "name": "米領バージン諸島"
  },
  {
    "code": "+681",
    "name": "ワリス・フツナ"
  },
  {
    "code": "",
    "name": "西サハラ"
  },
  {
    "code": "+967",
    "name": "イエメン"
  },
  {
    "code": "+260",
    "name": "ザンビア"
  },
  {
    "code": "+263",
    "name": "ジンバブエ"
  },
  {
    "code": "+358",
    "name": "オーランド諸島"
  }
]

export default countries;